Revit 2024 API
NotTransmittedModelException Class
The exception thrown when OpenOptions were provided to deal with a transmitted model, but the model is not transmitted.
Namespace: Autodesk.Revit.Exceptions
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2014
Syntax
C#
[SerializableAttribute]
public class NotTransmittedModelException : InvalidOperationException
Visual Basic
<SerializableAttribute> _
Public Class NotTransmittedModelException _
	Inherits InvalidOperationException
Visual C++
[SerializableAttribute]
public ref class NotTransmittedModelException : public InvalidOperationException
Inheritance Hierarchy
System.Object
 System.Exception
 Autodesk.Revit.Exceptions.ApplicationException
 Autodesk.Revit.Exceptions.InvalidOperationException
 Autodesk.Revit.Exceptions.NotTransmittedModelException
See Also
NotTransmittedModelException Members
Autodesk.Revit.Exceptions Namespace